
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/cocoide/aws-ecs/actions/runs/4289785999)



<pre><code>Apply complete! Resources: 7 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
data.aws_iam_policy_document.ecs_task_assume: Reading...
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-00ec53614ec162c10]
data.aws_iam_policy_document.ecs_assume: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0706f7119af5cd4c0]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-04a0e1e6a67e9c9e5]
aws_ecr_repository.ecr_repository: Refreshing state... [id=golang-server]
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=320642683]
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=320642683]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=golang-server]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:263325745760:targetgroup/golang-server-target-group/d8ad3df87212743b]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ea504b634a38d765]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-02172262f4929ea4a]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-059b2d6513f7016a6]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c4aade2c33e61df0]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-064b9ce76f2caea7b]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09f530f2af3d06382]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09e0fb9f71f4b1bc1]
aws_security_group.alb: Refreshing state... [id=sg-02b7bf20624cca338]
aws_security_group.ecs: Refreshing state... [id=sg-03e925085929b2a2a]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0671aa01347b05132]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-970747601]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-080f75e69f7af2f8e]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a1ea0282dfeb569b]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-064b9ce76f2caea7b1080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0c70654710f5f82e7]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0d09bd6559194d43e]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0529bf93ccc0ef0ac]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0da0c116dd0f80bd8]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:263325745760:loadbalancer/app/golang-server-alb/b4a4f8080b3efb6d]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0c4aade2c33e61df01080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09e0fb9f71f4b1bc11080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:263325745760:listener/app/golang-server-alb/b4a4f8080b3efb6d/6277e5de37148c72]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:263325745760:listener-rule/app/golang-server-alb/b4a4f8080b3efb6d/6277e5de37148c72/61278361fb6be1ce]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cloudwatch_log_group will be created
  + resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/golang-server"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "golang-server"
      + tags_all           = (known after apply)

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "golang-server"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "golang-server"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:263325745760:targetgroup/golang-server-target-group/d8ad3df87212743b"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-03e925085929b2a2a",
            ]
          + subnets          = [
              + "subnet-02172262f4929ea4a",
              + "subnet-0ea504b634a38d765",
            ]
        }
    }

  # aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "HEALTH_CHECK_PATH"
                          + value = "/health_checks"
                        },
                      + {
                          + name  = "NGINX_PORT"
                          + value = "8080"
                        },
                    ]
                  + image            = "medpeer/health_check:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/golang-server"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "golang-server"
                        }
                    }
                  + name             = "golang-server"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "golang-server"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # aws_iam_role.ecs will be created
  + resource "aws_iam_role" "ecs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "golang-server-ecs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "golang-server-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.ecs_basic will be created
  + resource "aws_iam_role_policy_attachment" "ecs_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "golang-server-ecs"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
aws_iam_role.ecs_task: Creating...
aws_iam_role.ecs: Creating...
aws_cloudwatch_log_group.cloudwatch_log_group: Creating...
aws_ecs_cluster.ecs_cluster: Creating...
aws_iam_role.ecs_task: Creation complete after 1s [id=golang-server-ecs-task]
aws_iam_role.ecs: Creation complete after 1s [id=golang-server-ecs]
aws_iam_role_policy_attachment.ecs_basic: Creating...
aws_iam_role_policy_attachment.ecs_basic: Creation complete after 0s [id=golang-server-ecs-20230228051437760700000001]
aws_cloudwatch_log_group.cloudwatch_log_group: Creation complete after 1s [id=/aws/ecs/golang-server]
aws_ecs_task_definition.ecs_task_definition: Creating...
aws_ecs_task_definition.ecs_task_definition: Creation complete after 1s [id=golang-server]
aws_ecs_cluster.ecs_cluster: Still creating... [10s elapsed]
aws_ecs_cluster.ecs_cluster: Creation complete after 12s [id=arn:aws:ecs:ap-northeast-1:263325745760:cluster/golang-server]
aws_ecs_service.ecs_service: Creating...
aws_ecs_service.ecs_service: Creation complete after 1s [id=arn:aws:ecs:ap-northeast-1:263325745760:service/golang-server/golang-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":6,"Program":"tfcmt","SHA1":"dab0b22baf881187e8d936ef1cd96a6ce5cb53a4","Vars":{},"WorkflowName":"Terraform"} -->